oscar-bio-dev/edge-telemetry-gateway/sdkconfig.defaults.esp32p4
# ===========================================================================
#  Edge Telemetry Gateway — ESP32-P4 specific sdkconfig
# ===========================================================================

# Target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM (in-package, 16 or 32 MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Use PSRAM for large allocations
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Dual-core configuration
CONFIG_FREERTOS_UNICORE=n

# Ethernet (EMAC + IP101GRI RMII)
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y

# UART for IPC (460800 bps on GPIO14/GPIO15)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Hardware crypto acceleration (ESP32-P4 specific)
CONFIG_MBEDTLS_HARDWARE_ECDSA_SIGN=y
CONFIG_MBEDTLS_HARDWARE_ECDSA_VERIFY=y
